Tekla Open API Reference for Tekla Structures 2025
FormingStates Constructor
Overload List
Name | Description
FormingStates()
 Initializes a new instance of the FormingStates class.
FormingStates(DeformingType)
 Initializes a new instance of the FormingStates class.
FormingStates(FoldingType)
 Initializes a new instance of the FormingStates class.
FormingStates(WrappingType)
 Initializes a new instance of the FormingStates class.
FormingStates(DeformingType, FoldingType, WrappingType)
 Initializes a new instance of the FormingStates class.
Top
See Also
Reference
FormingStates Class
Tekla.Structures.Forming Namespace